export const oxQuizTemplate = {
  quiz: [
    {
      id: 1,
      title: "SW교육은 초등학교 5학년부터 의무화 교육이다",
      description:
        "소프트웨어 교육은 2015 개정 교육과정 도입에 따라 2018년부터 중학교 1학년을 시작으로 2019년 초등학교 5, 6학년과 중학교 2학년, 2020년 중학교 3학년으로 확대됩니다. 초등학교는 실과 과목을 통해 17시간 이상, 중학교는 단계적으로 정보 과목을 통해 34시간 이상 소프트웨어 교육을 의무적으로 실시해야 합니다.",
      answer: "o",
    },
    {
      id: 2,
      title: "SW 교육 목표는 컴퓨팅 사고력을 통한 문제해결 능력의 향상이다",
      description:
        "교육부에서는 소프트웨어 교육이 코딩 기술 습득이 아니라 소프트웨어의 기본원리 이해를 통해 컴퓨팅 사고력과 논리력을 배우고, 이를 바탕으로 창의적 문제해결능력을 증진시키는 데 그 목적이 있음을 발표했습니다.",
      answer: "o",
    },
    {
      id: 3,
      title: "SW 교육은 시스템을 개발하는 것이 최종 목표이다",
      description:
        "SW 교육은 시스템 개발 역량보다는 정보윤리 의식과 태도를 바탕으로 실생활의 문제를 컴퓨팅 사고로 해결할 수 있도록 하는 것에 중점을 두고있습니다. 이론이나 문법, 지식 위주의 교육보다는 창작, 활동 중심의 수업으로 진행하는 것이 바람직합니다.",
      answer: "x",
    },
    {
      id: 4,
      title: "코딩 교육과 SW교육은 같은 교육이다",
      description:
        "소프트웨어 교육의 궁극적인 목적을 코딩교육으로 보기는 어렵습니다. 코딩은 소프트웨어 교육의 한 분야일 뿐이고, 교육 목표를 달성하기 위한 도구일 뿐입니다.",
      answer: "x",
    },
  ],
};
